# -*- coding: utf-8 -*-
import hashlib
import itertools

lib = ['あ', 'い', 'う', 'え', 'お', 'か', 'き', 'く', 'け', 'こ', 'さ', 'し', 'す', 'せ', 'そ', 'た', 'ち', 'つ', 'て', 'と', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'ま', 'み', 'む', 'め', 'も', 'や', 'ゆ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'わ', 'を', 'ん', 'が', 'ぎ', 'ぐ', 'げ', 'ご', 'ざ', 'じ', 'ず', 'ぜ', 'ぞ', 'だ', 'ぢ', 'づ', 'で', 'ど', 'ば', 'び', 'ぶ', 'べ', 'ぼ', 'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ']
# lib = ['ひ', 'ら', 'が', 'な']


ans = '3c026fc3d9f18'

for i in list(itertools.product(range(len(lib)), repeat=4)):
    s = lib[i[0]] + lib[i[1]] + lib[i[2]] + lib[i[3]]
    h = hashlib.md5(s).hexdigest()
    if ans in h:
        print(h)
        break
